package com.m9d.sroom.util.constant;

public class MaterialConstant {
    public static final String MATERIAL_STR_FROM_AI_SERVER = "{\n" +
            "    \"results\": [\n" +
            "        {\n" +
            "            \"video_id\": \"S7l1qX0WhqE\",\n" +
            "            \"is_valid\": 1,\n" +
            "            \"summary\": \"<button id=\\\"00000\\\" class=\\\"timestamp\\\" style=\\\"color:#FA5B3E;font-size: 1.125rem;line-height: 1.75rem;text-decoration-line:none;display:inline-block;background-color:rgba(250, 91, 62, 0.2);border-radius:0.25rem;padding:0.125rem 0.25rem;\\\">0:00:00</button>\\n### 데이터베이스 정규화 및 성능 향상\\n- 개요: 이번 시간에는 2020년 도일 기출 문제를 풀어보고, 데이터베이스 모델링 과정 중 비정규와 정규화의 개념을 간략히 설명하였습니다.\\n- 정규화 과정: 개념 설계, 논리 설계, 물리 설계로 나눠지며, 각 과정에서는 데이터베이스 설계를 진행하고 정규화를 수행합니다.\\n- 성능 향상을 위한 반정규화: 데이터베이스의 성능을 향상시키기 위해 정규화에 위배되는 반정규화 기법을 사용합니다.\\n- 이상 현상과 반정규화: 중복된 데이터가 존재하거나 이상한 현상이 생기는 경우, 반정규화를 통해 이상 현상을 없앱니다.\\n- 정리: 데이터베이스 정규화를 통해 데이터를 체계적으로 모델링하고, 성능 향상을 위해 반정규화를 수행합니다.\",\n" +
            "            \"quizzes\": [\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"데이터베이스 정규화의 개념은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"데이터베이스 설계를 진행하는 과정\",\n" +
            "                        \"데이터를 체계적으로 모델링하는 과정\",\n" +
            "                        \"데이터베이스의 성능을 향상시키는 과정\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"반정규화는 왜 사용하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"데이터를 체계적으로 모델링하기 위해\",\n" +
            "                        \"데이터베이스의 성능을 향상시키기 위해\",\n" +
            "                        \"데이터의 중복을 없애기 위해\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"정규화는 무엇을 위해 수행하는 작업인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"테이블 중복 제거\",\n" +
            "                        \"컬럼 기반 분할\",\n" +
            "                        \"컬럼 중복 제거\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"HTML은 어떤 종류의 마크업 언어인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"HTML\",\n" +
            "                        \"SGML\",\n" +
            "                        \"XML\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"HTML이란 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"마크업 언어\",\n" +
            "                        \"프로그래밍 언어\",\n" +
            "                        \"데이터 전송 방식\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"모듈의 독립성을 높이기 위해서는 어떤 것을 낮추고 높여야 하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"결합도\",\n" +
            "                        \"응집도\",\n" +
            "                        \"테스팅\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"결합도와 응집도는 무엇을 나타내는 지 알려주세요.\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"모듈의 독립성\",\n" +
            "                        \"모듈 간의 상호 의존 정도\",\n" +
            "                        \"모듈 내부의 기능적인 집중 정도\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"결합도를 낮추고 응집도를 높이기 위해서는 어떻게 해야 할까요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"모듈 간의 상호 의존 정도를 높이기\",\n" +
            "                        \"기능적인 집중 정도를 낮추기\",\n" +
            "                        \"모듈 간의 상호 의존 정도를 낮추고 기능적인 집중 정도를 높이기\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"자기능 음식도란 무엇을 의미하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"모듈 내부에 있는 기능을 호출하는 것\",\n" +
            "                        \"모듈 내부 기능들이 묶여 있는 것\",\n" +
            "                        \"기능들이 순차적으로 정지하는 것\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"JSON은 무엇의 약자이며 어떤 용도로 사용되나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"Java Script Object Network, 데이터 전송에 사용됨\",\n" +
            "                        \"Java Serialized Object Notation, 객체 직렬화에 사용됨\",\n" +
            "                        \"JavaScript Object Notation, 구조화된 데이터 표현에 사용됨\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"셀렉트 구조에서 가져올 데이터를 선택하는 명령어는?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"셀렉트\",\n" +
            "                        \"프롬\",\n" +
            "                        \"웨어\",\n" +
            "                        \"그룹 바이\",\n" +
            "                        \"오더 바이\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"랜더 테이라는 공격 유형은 무엇인가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"출발지 IP와 목적지 IP가 같은 패킷을 보내는 공격 방법\",\n" +
            "                        \"수신자가 응답을 보낼 때 목적지 주소가 자기 자신이므로 계속해서 자기를 공격하는 방법\",\n" +
            "                        \"방화벽에서 출발지와 목적지가 같은 패킷을 제거하는 방법\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"정보보안의 3요소 중 기밀성은 무엇을 의미하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"데이터가 타인에게 노출되어서는 안 된다.\",\n" +
            "                        \"데이터는 인가되지 않은 사람이 변경할 수 없다.\",\n" +
            "                        \"데이터는 원하는 시점에 언제든지 사용 가능해야 한다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"디도스 공격은 무엇을 목적으로 하는 공격 방법인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"기밀성을 떨어뜨리기 위한 공격\",\n" +
            "                        \"무결성을 떨어뜨리기 위한 공격\",\n" +
            "                        \"가용성을 떨어뜨리기 위한 공격\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"계층 시켜 보는 것은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"프로토콜의 규약에 따라 데이터의 구문, 의미, 타이밍을 정의하는 것\",\n" +
            "                        \"데이터를 암호화하는 것\",\n" +
            "                        \"데이터를 쏠트하는 것\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"쏠트는 어떤 기법인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"암호에 고유한 값을 추가하여 레인보우테이블 공격을 피할 수 있게 하는 기법\",\n" +
            "                        \"데이터를 계층 시켜 보는 기법\",\n" +
            "                        \"암호를 해독하는 기법\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"스케줄링 알고리즘 중 선점 스케줄링과 비선점 스케줄링의 차이점은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"선점 스케줄링은 실행 중인 프로세스를 중단시킬 수 있지만, 비선점 스케줄링은 실행 중인 프로세스를 중단시킬 수 없다.\",\n" +
            "                        \"선점 스케줄링은 우선순위에 따라 프로세스를 스케줄링하지만, 비선점 스케줄링은 실행 시간을 기준으로 프로세스를 스케줄링한다.\",\n" +
            "                        \"선점 스케줄링은 멀티프로세싱 환경에서 사용되고, 비선점 스케줄링은 싱글프로세싱 환경에서 사용된다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"트랜잭션의 '독립성'이란 무엇을 의미하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"트랜잭션은 다른 트랜잭션의 실행 결과에 영향을 받지 않는다.\",\n" +
            "                        \"트랜잭션은 시스템이 중단되더라도 실행 결과가 유지된다.\",\n" +
            "                        \"트랜잭션은 모든 데이터를 일관된 상태로 유지한다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"전송 계층은 어떤 프로토콜을 사용하여 데이터를 전송하는 역할을 하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"TCP\",\n" +
            "                        \"UDP\",\n" +
            "                        \"HTTP\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"네트워크 계층에서 사용되는 프로토콜로 IP, ICMP, ARP, RARP이 있습니다. ARP 프로토콜은 어떤 역할을 하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"IP 주소를 MAC 주소로 변환해주는 역할\",\n" +
            "                        \"MAC 주소를 IP 주소로 변환해주는 역할\",\n" +
            "                        \"패킷을 전송하는 역할\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"스크립트 기간 계산을 위한 총 라인 수는 몇 라인인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"3천 라인\",\n" +
            "                        \"3만 라인\",\n" +
            "                        \"3백만 라인\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"시언어로 작성된 프로그램의 정렬된 결과는 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"50, 75, 85, 95, 100\",\n" +
            "                        \"0, 1, 2, 3\",\n" +
            "                        \"3\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                }\n" +
            "            ],\n" +
            "            \"tokens\": 33333\n" +
            "        },\n" +
            "        {\n" +
            "            \"video_id\": \"Kc1xRWy3-rs\",\n" +
            "            \"is_valid\": 1,\n" +
            "            \"summary\": \"<button id=\\\"00000\\\" class=\\\"timestamp\\\" style=\\\"color:#FA5B3E;font-size: 1.125rem;line-height: 1.75rem;text-decoration-line:none;display:inline-block;background-color:rgba(250, 91, 62, 0.2);border-radius:0.25rem;padding:0.125rem 0.25rem;\\\">0:00:00</button>\\n### 스크립트 정리\\n\\n- 2020년 4회 실기 기출문제를 풀기 위해서 공부하고 있다.\\n- 코로나 검사를 했는데 음성이어서 안심했지만 여전히 걱정이 있다.\\n- 목이 아프고, 시험이 끝날 때까지 건강하게 유지하고 싶다.\\n- 백신을 맞으면 안 좋을 것 같아서 아직 맞지 않았다.\\n- 주변 사람들도 조심하고, 걱정이 많다.\\n- 클래스 다이어그램과 유스케이스 다이어그램을 그리는 것에 대해 설명되었다.\\n- 디자인 패턴은 객체지향 프로그래밍 설계를 할 때 사용하는 패턴들의 모음이다.\\n- 디자인 패턴은 소스 코드의 모음으로 생각할 수 있다.\\n- 패키지 다이어그램, 구조 다이어그램, 행위 다이어그램 등이 있다.\\n- 클래스 다이어그램은 시스템을 구성하는 클래스들의 관계를 나타낸다.\\n- 패키지 다이어그램은 비슷한 것들을 묶어 놓은 것이다.\\n- 컴퍼넌트 다이어그램은 컴퍼넌트 구조 사이의 관계를 표현한다.\\n- 배치 다이어그램은 실행 시스템의 물리 구조를 표현한다.\\n- 유스케이스 다이어그램은 시스템의 기능과 사용자 사이의 관계를 나타낸다.\",\n" +
            "            \"quizzes\": [\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"디자인 패턴은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"객체지향 프로그래밍 설계를 할 때 사용하는 패턴들의 모음\",\n" +
            "                        \"시스템을 구성하는 클래스들의 관계를 나타내는 다이어그램\",\n" +
            "                        \"시스템의 기능과 사용자 사이의 관계를 나타내는 다이어그램\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"패키지 다이어그램은 무엇을 나타내는 것인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"비슷한 것들을 묶어 놓은 것\",\n" +
            "                        \"객체지향 프로그래밍 설계를 할 때 사용하는 패턴들의 모음\",\n" +
            "                        \"시스템의 기능과 사용자 사이의 관계를 나타내는 다이어그램\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"다이어그램 통신은 무엇을 시각화하는 도구인가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"상호 작용\",\n" +
            "                        \"테스트 오라클\",\n" +
            "                        \"테스트 기법\",\n" +
            "                        \"SQL 문\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"테스트 오라클 중 입력 값을 기대하는 결과와 비교하기 위해 사용되는 오라클은 무엇인가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"참 오라클\",\n" +
            "                        \"샘플링 오라클\",\n" +
            "                        \"휴리스틱 오라클\",\n" +
            "                        \"일관성 검사 오라클\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"학과로 그룹 파일을 하는 목적은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"결과값을 확인하기 위해\",\n" +
            "                        \"학과별로 풀 수를 알아보기 위해\",\n" +
            "                        \"학과별로 그룹핑하기 위해\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"스니핑이란 무엇을 의미하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"패킷의 내용을 엿보는 행위\",\n" +
            "                        \"네트워크상의 통과되는 패킷들을 분석하는 행위\",\n" +
            "                        \"네트워크상의 통신을 가로채는 행위\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"데이터베이스 정규화의 목적은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"중복을 제거하고 데이터의 일관성과 무결성을 유지하기 위함\",\n" +
            "                        \"데이터의 안정성을 보장하기 위함\",\n" +
            "                        \"데이터의 저장 공간을 절약하기 위함\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"제 1 정규형에 대한 설명 중 옳은 것은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"부분 함수 종속을 제거하여 핵심 속성을 한 테이블에 포함\",\n" +
            "                        \"도메인이 원자값이 되도록 테이블을 분리\",\n" +
            "                        \"이행 함수 종속을 제거하여 조인 종속을 이용하거나 제거\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"지연 갱신과 즉시 갱신 중 어떤 것이 변경된 내용을 바로 데이터베이스에 반영하는 기법인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"지연 갱신\",\n" +
            "                        \"즉시 갱신\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"리드와 언두 기법은 어떤 목적을 위해 수행되어야 하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"데이터베이스 복구\",\n" +
            "                        \"데이터 저장\",\n" +
            "                        \"데이터 조회\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"IPv4와 IPv6의 차이점은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"주소 변환 기술\",\n" +
            "                        \"디스패치 타임\",\n" +
            "                        \"블록 메이크업\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"빅데이터 솔루션은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"운영체제: 유닉스\",\n" +
            "                        \"정형 데이터 vs 비정형 데이터\",\n" +
            "                        \"IPv4 주소 클래스 (A, B, C)\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"빅데이터와 데이터 마이닝에 대한 설명 중 맞는 것은?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"빅데이터는 많은 양의 데이터로부터 가치를 추출하고 결과를 분석하는 기술이다.\",\n" +
            "                        \"데이터 마이닝은 대규모로 저장된 데이터 안에서 체계적이고 자동적으로 통계적 규칙이나 패턴을 찾아내는 것이다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"데이터 웨어하우스와 데이터 마트에 대한 설명 중 맞는 것은?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"데이터 웨어하우스는 자기 간 시스템의 데이터베이스 축전처럼 데이터를 공통 형식으로 변환하여 관리하는 큰 데이터베이스이다.\",\n" +
            "                        \"데이터 마트는 데이터 웨어하우스의 일부분으로, 특정 사용자가 관심을 갖는 작은 규모의 데이터 웨어하우스이다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"네트워크 주소 변환은 무엇을 변환하는 방식인가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"내부 사설 IP 주소와 외부 공인 IP 주소\",\n" +
            "                        \"내부 사설 IP 주소와 내부 사설 IP 주소\",\n" +
            "                        \"외부 공인 IP 주소와 외부 공인 IP 주소\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"포인터 p가 10번지를 가리키고 있다. p가 가리키는 주소부터 끝까지 출력할 때, 예상되는 출력 결과는 무엇인가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"korea와 2a\",\n" +
            "                        \"korea와 10\",\n" +
            "                        \"korea와 10번지의 문자열\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"다음 코드의 출력 결과는 무엇인가?\\n\\nfor(int i=1; i<=9; i++) {\\n    for(int j=1; j<=5; j++) {\\n        System.out.print(i*j + \\\" \\\");\\n    }\\n    System.out.println();\\n}\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"1 2 3 4 5\\n2 4 6 8 10\\n3 6 9 12 15\",\n" +
            "                        \"1 1 1 1 1\\n2 2 2 2 2\\n3 3 3 3 3\",\n" +
            "                        \"1 2 3 4 5\\n2 4 6 8 10\\n3 9 12 15 18\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"j 값이 0보다 작고 영이 아닐 때, 배열 arr에 어떤 값을 넣어야 하는지 확인해보면 무엇이 들어가는지 알 수 있습니다.\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"0\",\n" +
            "                        \"1\",\n" +
            "                        \"3\",\n" +
            "                        \"4\"\n" +
            "                    ],\n" +
            "                    \"answer\": 4\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"i 값이 8보다 작을 때, 다음에 들어가야 하는 값은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"2\",\n" +
            "                        \"3\",\n" +
            "                        \"4\",\n" +
            "                        \"6\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"같은 경우에는 아이가 a 점 랭스 라고 했잖아요. 랭스가 같은 경우에는 무엇을 구하는 건가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"길이\",\n" +
            "                        \"높이\",\n" +
            "                        \"너비\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"아이 값이 0일 때, 아이플러스플러스를 해서 몇이 되나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"-1\",\n" +
            "                        \"0\",\n" +
            "                        \"1\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"변수 c를 사용하여 계산을 진행한 후, 일이 1보다 작거나 같으면 1이 되는 상황에서 c의 값이 어떻게 변하게 될까요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"0\",\n" +
            "                        \"1\",\n" +
            "                        \"2\",\n" +
            "                        \"3\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"주어진 파이썬 프로그램의 출력 결과는 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"1, 2, 3\",\n" +
            "                        \"1, 2, 3, 7\",\n" +
            "                        \"1, 2, 3, 4, 5, 6, 7, 8, 9\",\n" +
            "                        \"7, 8, 9\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                }\n" +
            "            ],\n" +
            "            \"tokens\": 31437\n" +
            "        },\n" +
            "        {\n" +
            "            \"video_id\": \"eBu65lFAyjo\",\n" +
            "            \"is_valid\": 1,\n" +
            "            \"summary\": \"<button id=\\\"00000\\\" class=\\\"timestamp\\\" style=\\\"color:#FA5B3E;font-size: 1.125rem;line-height: 1.75rem;text-decoration-line:none;display:inline-block;background-color:rgba(250, 91, 62, 0.2);border-radius:0.25rem;padding:0.125rem 0.25rem;\\\">0:00:00</button>\\n### 정석 인가 쓰입니다\\n오늘은 2020년 3회 실기 기출 문제들을 풀어보도록 하겠습니다. 이번 강의는 소방헬기 소리가 마이크로 들어갈 수 있어서 조금 양해를 부탁드리겠습니다. 형상 통제에 대해 간략히 설명하자면, 형상 관리 절차는 형상식별, 형상통제, 형상감사, 형상기록으로 이루어져 있습니다. 형상 통제는 변경 요청 사항을 검토하고 승인하여 현재 베이스 라인에 반영하는 과정을 말합니다. 형상 감사는 형상의 정확성을 보는 것이고, 형상 기록은 기록하는 것입니다. 형상 통제는 형상 변경 요청을 승인하고 현재 베이스 라인에 반영하는 과정을 말합니다. 형상 관리 절차는 형상식별, 형상통제, 형상감사, 형상기록으로 이루어져 있으며, 이는 실무에서 중요한 개념입니다.\\n\\n### EAI 구축 유형에 대한 설명\\nEAI는 기업의 어플리케이션들을 통합하는 것을 말합니다. EAI 구축 유형에는 P2P (Point-to-Point), 허브 앤 스포크, 메시지 버스, 하이브리드가 있습니다. P2P는 미들웨어를 사용하지 않고 각 어플리케이션들을 직접 연결하는 방식입니다. 허브 앤 스포크는 중앙 시스템을 통해 데이터를 전송하는 방식이며, 확장 및 유지보수가 용이합니다. 하지만 변경 시 다시 개발해야 하므로 재사용이 어렵습니다. 허브 앤 스포크는 단일 접점을 통해 데이터를 전송하는 중앙 집중적인 방식입니다. 이번 문제에서는 P2P와 허브 앤 스포크가 정답입니다.\",\n" +
            "            \"quizzes\": [\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"형상 통제는 무엇을 의미하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"형상식별, 형상통제, 형상감사, 형상기록\",\n" +
            "                        \"형상 변경 요청을 승인하고 현재 베이스 라인에 반영하는 과정\",\n" +
            "                        \"형상의 정확성을 보는 것\",\n" +
            "                        \"기록하는 것\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"EAI 구축 유형 중 어떤 유형들이 있나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"P2P (Point-to-Point), 허브 앤 스포크\",\n" +
            "                        \"허브 앤 스포크, 메시지 버스, 하이브리드\",\n" +
            "                        \"메시지 버스, 하이브리드\",\n" +
            "                        \"P2P, 메시지 버스\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"버스를 통해 제공되는 서비스의 형태는 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"메세지 박스 방식\",\n" +
            "                        \"웹 애플리케이션\",\n" +
            "                        \"모바일 애플리케이션\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"UI 설계 원칙 중 '유연성'은 무엇을 의미하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"사용자의 목적을 정확하게 달성해야 함\",\n" +
            "                        \"사용자가 기능을 쉽게 파악할 수 있어야 함\",\n" +
            "                        \"사용자 요구사항을 최대한 수용하며 오류를 최소화해야 함\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"스크립트에 대한 설명 중 옳은 것은?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"스크립트는 개별 조건 식에 대해 수행하는 테스트 커버리지이다.\",\n" +
            "                        \"스크립트는 결정 포인트 내 모든 분기문에 대해 수행하는 테스트 커버리지이다.\",\n" +
            "                        \"스크립트는 결정 포인트의 모든 개별 조건식 가능한 조합을 100% 보장해야 하는 커버리지이다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"다중 조건 커버리지에 대한 설명 중 옳은 것은?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"다중 조건 커버리지는 결정 포인트의 모든 개별 조건식 가능한 조합을 100% 보장해야 하는 커버리지이다.\",\n" +
            "                        \"다중 조건 커버리지는 모든 결정 포인트 내에 개별 조건식을 적어도 한 번 틀어야 하는 커버리지이다.\",\n" +
            "                        \"다중 조건 커버리지는 모든 개별 조건식에 대해 수행하는 커버리지를 말한다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"성적 테이블에서 과목별 평균 점수가 90점 이상인 과목의 이름, 최소 점수, 최대 점수를 출력하는 SQL 문은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"SELECT 과목이름, MIN(점수) AS 최소점수, MAX(점수) AS 최대점수 FROM 성적 GROUP BY 과목이름 HAVING AVG(점수) >= 90;\",\n" +
            "                        \"SELECT 과목이름, MIN(점수) AS 최소점수, MAX(점수) AS 최대점수 FROM 성적 WHERE AVG(점수) >= 90 GROUP BY 과목이름;\",\n" +
            "                        \"SELECT 과목이름, MIN(점수) AS 최소점수, MAX(점수) AS 최대점수 FROM 성적 WHERE AVG(점수) >= 90;\",\n" +
            "                        \"SELECT 과목이름, MIN(점수) AS 최소점수, MAX(점수) AS 최대점수 FROM 성적 GROUP BY 과목이름 HAVING AVG(점수) > 90;\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"SQL 문에서 평균 점수가 90점 이상인 과목만 선택하기 위해 사용하는 절은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"SELECT\",\n" +
            "                        \"FROM\",\n" +
            "                        \"GROUP BY\",\n" +
            "                        \"HAVING\"\n" +
            "                    ],\n" +
            "                    \"answer\": 4\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"스키마는 무엇을 나타내는 것인가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"데이터베이스의 전체적인 구조와 제약 조건\",\n" +
            "                        \"데이터베이스의 외부 구조\",\n" +
            "                        \"데이터베이스의 개념적 구조\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"외부 스키마는 무엇인가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"사용자가 보는 관점에서의 데이터베이스 구조\",\n" +
            "                        \"데이터베이스의 전체적인 구조와 제약 조건\",\n" +
            "                        \"데이터베이스의 개념적 구조\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"스키마의 종류 중에서 외부 스키마에 영향을 주지 않는 변경을 무엇이라고 할까요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"논리적 독립성\",\n" +
            "                        \"물리적 독립성\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"관계 대수 연산 중에서 릴레이션 A에서 릴레이션 B의 조건을 만족하지 않는 튜플을 제외한 후 프로젝션하는 연산은 무엇일까요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"선택(셀렉트)\",\n" +
            "                        \"나누기(디비전)\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"서울에서 원주까지 오는 길을 결정하는 프로토콜은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"OSPF\",\n" +
            "                        \"ICMP\",\n" +
            "                        \"TCP\",\n" +
            "                        \"UDP\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"라우터는 어떤 역할을 하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"데이터 전송\",\n" +
            "                        \"데이터 암호화\",\n" +
            "                        \"데이터 저장\",\n" +
            "                        \"데이터 처리\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"헝가리안 표기법은 무엇을 명시하지 않는 코딩 규칙인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"변수나 함수의 인자 이름\",\n" +
            "                        \"데이터 타입\",\n" +
            "                        \"코딩 스타일\",\n" +
            "                        \"주석\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"리팩토링의 주요 목적은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"코드의 구조를 조정하기\",\n" +
            "                        \"기능을 개선하기\",\n" +
            "                        \"코드를 깨끗하게 만들기\",\n" +
            "                        \"성능 향상\"\n" +
            "                    ],\n" +
            "                    \"answer\": 4\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"베이크 클래스는 무엇을 상속받고 있습니까?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"카 클래스\",\n" +
            "                        \"부모 클래스\",\n" +
            "                        \"자식 클래스\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"베이크 클래스의 생성자는 어떤 역할을 합니까?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"객체를 삭제하는 역할\",\n" +
            "                        \"객체를 생성할 때 초기값을 설정하는 역할\",\n" +
            "                        \"객체를 복제하는 역할\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"생성자는 무엇을 초기화하는 목적으로 주로 사용되는 메서드인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"멤버 변수\",\n" +
            "                        \"메소드\",\n" +
            "                        \"상속\",\n" +
            "                        \"객체\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"생성자는 객체가 생성될 때 언제 호출되나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"객체가 사용될 때\",\n" +
            "                        \"객체를 생성할 때\",\n" +
            "                        \"객체를 삭제할 때\",\n" +
            "                        \"객체를 수정할 때\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                }\n" +
            "            ],\n" +
            "            \"tokens\": 28344\n" +
            "        },\n" +
            "        {\n" +
            "            \"video_id\": \"lv4-n_s5AvI\",\n" +
            "            \"is_valid\": 1,\n" +
            "            \"summary\": \"<button id=\\\"00000\\\" class=\\\"timestamp\\\" style=\\\"color:#FA5B3E;font-size: 1.125rem;line-height: 1.75rem;text-decoration-line:none;display:inline-block;background-color:rgba(250, 91, 62, 0.2);border-radius:0.25rem;padding:0.125rem 0.25rem;\\\">0:00:00</button>\\n### 음악 정수 횡단 3\\n이번 시간에는 2020년 이외 실기 기출 문제에 대해 진행해 보도록 하겠습니다. 실기 이외의 정도부터는 이제 합격률이 조금씩 올라가기 시작했습니다. 이외의 경우는 5%로 조금씩 증가하고 있으며, 20%에서 30%를 유지할 것으로 예상됩니다. 자격증은 보통 20%에서 30%를 유지해야 하는데, 정보처리기사 시험 2는 어떤 출제가 될지 알 수 없습니다. 교재에 나오지 않은 것들이 많이 있어 어떤 것들이 출제될지 모르겠지만, 열심히 준비해주셨으면 좋겠습니다.\",\n" +
            "            \"quizzes\": [\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"정보처리기사 시험의 합격률은 어느 정도인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"20%\",\n" +
            "                        \"30%\",\n" +
            "                        \"5%\",\n" +
            "                        \"1%\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"소프트웨어 개발 방법론 중 요구사항을 계속해서 받아들여 개발해나가는 방식은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"폭포수 모형\",\n" +
            "                        \"애자일 방법론\",\n" +
            "                        \"프로토타입 모형\",\n" +
            "                        \"나선형 모형\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"데이터베이스 설계의 순서는 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"논리 설계, 개념 설계, 물리 설계\",\n" +
            "                        \"개념 설계, 물리 설계, 논리 설계\",\n" +
            "                        \"물리 설계, 논리 설계, 개념 설계\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"소비와 레스트의 차이점은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"소비는 HTTP 프로토콜을 사용하고, 레스트는 XML을 기반으로 데이터를 전송한다.\",\n" +
            "                        \"소비는 XML 형태로 데이터를 전송하고, 레스트는 헤더에 투시를 해가며 다양한 형태로 데이터를 전송한다.\",\n" +
            "                        \"소비는 XML 형태로 데이터를 전송하고, 레스트는 HTTP 프로토콜을 사용하여 XML 기반의 메세지를 전달한다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"형상 관리란 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"소프트웨어 개발을 위한 도구\",\n" +
            "                        \"문서 관리를 위한 도구\",\n" +
            "                        \"형상 식별, 형상 통제 등을 위한 도구\",\n" +
            "                        \"소프트웨어 개발 및 컴퓨터 시스템 관리를 위한 도구\"\n" +
            "                    ],\n" +
            "                    \"answer\": 4\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"형상 관리 도구의 분류 중 공유폴더 방식에 대한 설명으로 옳은 것은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"소스 코드를 중앙 서버에 저장하는 방식입니다.\",\n" +
            "                        \"소스 코드를 공유 폴더에 저장하는 방식입니다.\",\n" +
            "                        \"개인 컴퓨터와 원격지 컴퓨터에서 소스 코드를 관리하는 방식입니다.\",\n" +
            "                        \"형상 관리에 대한 기록을 남기는 방식입니다.\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"UI 설계의 직관성에 대한 설명으로 옳은 것은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"사용자가 쉽게 이해하고 사용할 수 있어야 함\",\n" +
            "                        \"목적을 정확하게 달성해야 함\",\n" +
            "                        \"누구나 쉽게 배우고 익힐 수 있어야 함\",\n" +
            "                        \"사용자의 요구사항을 잘 받아들여야 함\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"테스트 종류 중 정적 테스트에 대한 설명으로 옳은 것은 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"프로그램을 실행시켜 동작을 확인함\",\n" +
            "                        \"소스 코드를 실행시키지 않고 내부 구조를 분석함\",\n" +
            "                        \"개발자가 프로그램을 검증함\",\n" +
            "                        \"사용자가 프로그램을 확인함\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"다음 중 소프트웨어 테스트의 종류로 맞는 것은?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"유닛 테스트\",\n" +
            "                        \"백발백중 테스트\",\n" +
            "                        \"모의 해킹 테스트\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"다음 중 SQL 인젝션에 대한 설명으로 틀린 것은?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"SQL 구문에 악의적으로 조작된 입력 값을 삽입하는 기법\",\n" +
            "                        \"웹 프로그램의 취약점을 이용하여 데이터베이스를 공격하는 기법\",\n" +
            "                        \"보안 취약점을 방어하기 위한 기법\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"안드로이드는 어떤 운영체제를 기반으로 동작하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"리눅스\",\n" +
            "                        \"윈도우\",\n" +
            "                        \"맥 OS\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"리눅스 또는 유닉스에서 파일의 권한을 변경하기 위해 사용하는 명령어는 무엇인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"chmod\",\n" +
            "                        \"chown\",\n" +
            "                        \"chdir\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"권한 표기 방식 중 8진수는 몇 자리로 표기되나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"1자리\",\n" +
            "                        \"2자리\",\n" +
            "                        \"3자리\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"권한 변경 명령어 'chmod 755 filename'에서 숫자 755는 무엇을 의미하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"사용자에게 읽기, 쓰기, 실행 권한 부여\",\n" +
            "                        \"그룹에게 읽기, 실행 권한 부여\",\n" +
            "                        \"아더에게 실행 권한 부여\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"스마트폰 앱에서 오픈 데이터는 무엇을 제공하는 것인가요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"저작권 없이 무료로 제공되는 데이터\",\n" +
            "                        \"스마트폰 앱의 시간 제한\",\n" +
            "                        \"스마트폰 앱의 보상금\",\n" +
            "                        \"스마트폰 앱의 사용자 데이터 손실을 최소화하기 위한 백업\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"시맨틱 웹은 어떤 개념을 의미하나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"문서의 의미에 맞게 어플리케이션의 의미를 부여하는 것\",\n" +
            "                        \"옵저버 패턴을 활용하는 것\",\n" +
            "                        \"오픈 데이터를 활용하는 것\",\n" +
            "                        \"링크드 오픈 데이터와 비슷한 개념\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"시멘틱 웹은 무엇을 위해 웹 페이지를 구조적으로 정리하고 있는가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"검색 엔진이 정보를 읽고 활용하기 위해\",\n" +
            "                        \"웹 페이지의 시각적 디자인을 개선하기 위해\",\n" +
            "                        \"웹 페이지의 보안을 강화하기 위해\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"레스트 풀은 어떤 아키텍처를 구현한 웹 서비스인가?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"마이크로서비스 아키텍처\",\n" +
            "                        \"레이어드 아키텍처\",\n" +
            "                        \"레스트 아키텍처\"\n" +
            "                    ],\n" +
            "                    \"answer\": 3\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"자바에서 상속을 통해 어떤 기능을 사용할 수 있나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"부모 클래스의 기능\",\n" +
            "                        \"자식 클래스의 기능\",\n" +
            "                        \"형제 클래스의 기능\"\n" +
            "                    ],\n" +
            "                    \"answer\": 1\n" +
            "                },\n" +
            "                {\n" +
            "                    \"quiz_type\": 1,\n" +
            "                    \"quiz_question\": \"자바에서 오버라이딩은 무엇을 할 수 있나요?\",\n" +
            "                    \"quiz_select_options\": [\n" +
            "                        \"부모 클래스의 메서드를 재정의\",\n" +
            "                        \"자식 클래스의 메서드를 재정의\",\n" +
            "                        \"형제 클래스의 메서드를 재정의\"\n" +
            "                    ],\n" +
            "                    \"answer\": 2\n" +
            "                }\n" +
            "            ],\n" +
            "            \"tokens\": 29206\n" +
            "        }\n" +
            "    ]\n" +
            "}";
}
